In [2]:
import pandas as pd

 Scarica questi dati (http://dati.ustat.miur.it/dataset/laureati) in formato csv e utilizza pandas per: 
 - caricare i dati di ciascun csv all’interno di un dataframe; 
 - creare un’aggregazione del numero di laureati per ateneo; 
 - creare un’aggregazione del numero di laureati per residenza; 
 - creare un’aggregazione del numero di laureati per sesso; 
 - creare un’aggregazione del numero di laureati per tipo di laurea; 
 - creare un’aggregazione del numero di laureati per sesso e per tipo di laurea.

In [3]:
ateneo = pd.read_csv("laureatixateneo.csv", sep=";")
ateneo

      AnnoS  AteneoCOD          AteneoNOME SESSO   Lau
0      2020        101              Torino     F  9109
1      2020        101              Torino     M  5845
2      2020        102  Torino Politecnico     F  2301
3      2020        102  Torino Politecnico     M  5363
4      2020        201  Piemonte Orientale     F  1372
...     ...        ...                 ...   ...   ...
1972   2010       8701             Catania     M  2709
1973   2010       9001             Sassari     F  1150
1974   2010       9001             Sassari     M   610
1975   2010       9201            Cagliari     F  2649
1976   2010       9201            Cagliari     M  1447

[1977 rows x 5 columns]

In [4]:
residenza = pd.read_csv("laureatixresidenza.csv", sep=";")
residenza

      AnnoS  IstatP              ResidenzaP SESSO   Lau
0      2020       1                  TORINO     F  6512
1      2020       1                  TORINO     M  5357
2      2020       2                VERCELLI     F   410
3      2020       2                VERCELLI     M   305
4      2020       3                  NOVARA     F  1028
...     ...     ...                     ...   ...   ...
2393   2010     111            SUD SARDEGNA     M   504
2394   2010     998        PROVINCIA ESTERA     F  1553
2395   2010     998        PROVINCIA ESTERA     M  1312
2396   2010     999  PROVINCIA NON DEFINITA     F    49
2397   2010     999  PROVINCIA NON DEFINITA     M    43

[2398 rows x 5 columns]

In [5]:
corso = pd.read_csv("laureatixtipocorso.csv", sep=";")
corso

     AnnoS                                       CorsoTIPO SESSO    Lau
0     2020                              Laurea - dm 270/04     M  84357
1     2020  Laurea Specialistica a Ciclo Unico - dm 509/99     M    350
2     2020                Laurea Specialistica - dm 509/99     F    131
3     2020           Corsi di Laurea - vecchio ordinamento     F    524
4     2020                             Laurea  - dm 509/99     M    832
..     ...                                             ...   ...    ...
149   2010                              Laurea - dm 270/04     M   2442
150   2010                Laurea Specialistica - dm 509/99     M  30780
151   2010                   Laurea Magistrale - dm 270/04     F   5599
152   2010                              Laurea - dm 270/04     F   2731
153   2010                             Laurea  - dm 509/99     F  92608

[154 rows x 4 columns]

In [22]:
# ES2

ateneo[["Lau", "AteneoNOME"]].groupby("AteneoNOME").sum()

# l'indice in questo caso è diventata la colonna su cui si è fatto groupby

                                             Lau
AteneoNOME
Aosta                                       2294
Bari                                       83613
Bari Politecnico                           19644
Basilicata                                 10325
Benevento Giustino Fortunato - telematica   2074
...                                          ...
Udine                                      32554
Urbino                                     29070
Venezia C� Foscari                         49259
Venezia Iuav                               15681
Verona                                     49963

[91 rows x 1 columns]

In [25]:
# ES3

residenza[["Lau", "ResidenzaP"]].groupby("ResidenzaP").sum()

                 Lau
ResidenzaP
AGRIGENTO      28481
ALESSANDRIA    17756
ANCONA         29353
AOSTA           6386
AREZZO         17523
...              ...
VERCELLI        7625
VERONA         48705
VIBO VALENTIA  11218
VICENZA        45670
VITERBO        17750

[109 rows x 1 columns]

In [12]:
# ES4

dati[["Lau", "SESSO"]].groupby("SESSO").sum()

             Lau
SESSO
F      2005140.0
M      1445010.0

In [13]:
# ES5

dati[["Lau", "CorsoTIPO"]].groupby("CorsoTIPO").sum()

                                                      Lau
CorsoTIPO
Corsi di Laurea - vecchio ordinamento             80041.0
Laurea  - dm 509/99                              553503.0
Laurea - dm 270/04                              1414358.0
Laurea Magistrale - dm 270/04                    853938.0
Laurea Magistrale a Ciclo Unico - dm 270/04      292604.0
Laurea Specialistica - dm 509/99                 168204.0
Laurea Specialistica a Ciclo Unico - dm 509/99    87502.0

In [18]:
# ES6

dati[["Lau", "CorsoTIPO", "SESSO"]].groupby(["CorsoTIPO","SESSO"]).sum()

# questi prendono il nome di databse multi-index perche hanno doppio indice

                                                           Lau
CorsoTIPO                                      SESSO
Corsi di Laurea - vecchio ordinamento          F       58172.0
                                               M       21869.0
Laurea  - dm 509/99                            F      320063.0
                                               M      233440.0
Laurea - dm 270/04                             F      815910.0
                                               M      598448.0
Laurea Magistrale - dm 270/04                  F      484338.0
                                               M      369600.0
Laurea Magistrale a Ciclo Unico - dm 270/04    F      180972.0
                                               M      111632.0
Laurea Specialistica - dm 509/99               F       91285.0
                                               M       76919.0
Laurea Specialistica a Ciclo Unico - dm 509/99 F       54400.0
                                               M       33102.0

In [21]:
# fare l'aggregazione del numero di laureati rispetto la residenza per l'anno 2010

dati[dati["AnnoS"] == 2010][["Lau", "ResidenzaP"]].groupby("ResidenzaP").sum()

                Lau
ResidenzaP
BARI        69960.0
BRINDISI    15846.0
FOGGIA      14308.0
LECCE        7453.0
MATERA      95339.0
POTENZA     36379.0
TARANTO     46890.0